#pragma once

// Name: Medieval Dynasty, Version: 0.6.0.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Player_AnimBP.Player_AnimBP_C
// 0x3A529 (FullSize[0x3A7E1] - InheritedSize[0x02B8])
class UPlayer_AnimBP_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_5JFI[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_81;                 // 0x02C8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_160;                           // 0x0458(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_163;                        // 0x0480(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_80;                 // 0x0540(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_159;                           // 0x06D0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_158;                           // 0x06F8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_157;                           // 0x0720(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_156;                           // 0x0748(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_155;                           // 0x0770(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_79;                 // 0x0798(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_162;                        // 0x0928(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_40;                           // 0x09E8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_154;                           // 0x0B40(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_153;                           // 0x0B68(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_161;                        // 0x0B90(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_154;                         // 0x0C50(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_78;                 // 0x0CF0(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_77;                 // 0x0E80(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_152;                           // 0x1010(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_160;                        // 0x1038(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_76;                 // 0x10F8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_151;                           // 0x1288(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_150;                           // 0x12B0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_39;                           // 0x12D8(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_38;                           // 0x1430(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_37;                           // 0x1588(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_149;                           // 0x16E0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_148;                           // 0x1708(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_147;                           // 0x1730(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_159;                        // 0x1758(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_153;                         // 0x1818(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_75;                 // 0x18B8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_146;                           // 0x1A48(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_158;                        // 0x1A70(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_74;                 // 0x1B30(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_145;                           // 0x1CC0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_144;                           // 0x1CE8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_36;                           // 0x1D10(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_143;                           // 0x1E68(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_73;                 // 0x1E90(0x0190)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_152;                         // 0x2020(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_72;                 // 0x20C0(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_142;                           // 0x2250(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_151;                         // 0x2278(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_71;                 // 0x2318(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_141;                           // 0x24A8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_150;                         // 0x24D0(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_70;                 // 0x2570(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_140;                           // 0x2700(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_149;                         // 0x2728(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_157;                        // 0x27C8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_148;                         // 0x2888(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_139;                           // 0x2928(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_138;                           // 0x2950(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_156;                        // 0x2978(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_69;                 // 0x2A38(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_137;                           // 0x2BC8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_136;                           // 0x2BF0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_35;                           // 0x2C18(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_68;                 // 0x2D70(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_135;                           // 0x2F00(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_147;                         // 0x2F28(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_134;                           // 0x2FC8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_67;                 // 0x2FF0(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_155;                        // 0x3180(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_146;                         // 0x3240(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_133;                           // 0x32E0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_154;                        // 0x3308(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_66;                 // 0x33C8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_132;                           // 0x3558(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_34;                           // 0x3580(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_65;                 // 0x36D8(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_153;                        // 0x3868(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_64;                 // 0x3928(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_131;                           // 0x3AB8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_63;                 // 0x3AE0(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_130;                           // 0x3C70(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_62;                 // 0x3C98(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_152;                        // 0x3E28(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_33;                           // 0x3EE8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_129;                           // 0x4040(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_128;                           // 0x4068(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_61;                 // 0x4090(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_127;                           // 0x4220(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_32;                           // 0x4248(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_60;                 // 0x43A0(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_59;                 // 0x4530(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_151;                        // 0x46C0(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_145;                         // 0x4780(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_126;                           // 0x4820(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_31;                           // 0x4848(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_144;                         // 0x49A0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_125;                           // 0x4A40(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_150;                        // 0x4A68(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_143;                         // 0x4B28(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_58;                 // 0x4BC8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_124;                           // 0x4D58(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_30;                           // 0x4D80(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_142;                         // 0x4ED8(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_57;                 // 0x4F78(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_149;                        // 0x5108(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_148;                        // 0x51C8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_123;                           // 0x5288(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_122;                           // 0x52B0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_56;                 // 0x52D8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_121;                           // 0x5468(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_147;                        // 0x5490(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_55;                 // 0x5550(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_54;                 // 0x56E0(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_146;                        // 0x5870(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_120;                           // 0x5930(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_119;                           // 0x5958(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_118;                           // 0x5980(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_29;                           // 0x59A8(0x0158)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_145;                        // 0x5B00(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_53;                 // 0x5BC0(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_117;                           // 0x5D50(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_28;                           // 0x5D78(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_27;                           // 0x5ED0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_116;                           // 0x6028(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_115;                           // 0x6050(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_114;                           // 0x6078(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_139;                        // 0x60A0(0x00E8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_10;                            // 0x6188(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_113;                           // 0x6250(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_144;                        // 0x6278(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_141;                         // 0x6338(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_112;                           // 0x63D8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_111;                           // 0x6400(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_140;                         // 0x6428(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_52;                 // 0x64C8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_110;                           // 0x6658(0x0028)
	struct FAnimNode_CCDIK                             AnimGraphNode_CCDIK_2;                                     // 0x6680(0x0180)
	struct FAnimNode_CCDIK                             AnimGraphNode_CCDIK;                                       // 0x6800(0x0180)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_109;                           // 0x6980(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5;                     // 0x69A8(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_5;                     // 0x69C8(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_108;                           // 0x69E8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_107;                           // 0x6A10(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_138;                        // 0x6A38(0x00E8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_143;                        // 0x6B20(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_139;                         // 0x6BE0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_106;                           // 0x6C80(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_142;                        // 0x6CA8(0x00C0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_137;                        // 0x6D68(0x00E8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_51;                 // 0x6E50(0x0190)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_138;                         // 0x6FE0(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_141;                        // 0x7080(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_105;                           // 0x7140(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_140;                        // 0x7168(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_104;                           // 0x7228(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9;                             // 0x7250(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_136;                        // 0x7318(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_135;                        // 0x7400(0x00E8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_137;                         // 0x74E8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_136;                         // 0x7588(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_139;                        // 0x7628(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_138;                        // 0x76E8(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_26;                           // 0x77A8(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_50;                 // 0x7900(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_103;                           // 0x7A90(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_102;                           // 0x7AB8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_49;                 // 0x7AE0(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_48;                 // 0x7C70(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_101;                           // 0x7E00(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_137;                        // 0x7E28(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_100;                           // 0x7EE8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_136;                        // 0x7F10(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_99;                            // 0x7FD0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_135;                         // 0x7FF8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_98;                            // 0x8098(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_25;                           // 0x80C0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_97;                            // 0x8218(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_96;                            // 0x8240(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_95;                            // 0x8268(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_134;                         // 0x8290(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8;                             // 0x8330(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_134;                        // 0x83F8(0x00E8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_133;                        // 0x84E0(0x00E8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_13;                                     // 0x85C8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_135;                        // 0x8610(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_94;                            // 0x86D0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_93;                            // 0x86F8(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7;                             // 0x8720(0x00C8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_134;                        // 0x87E8(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_133;                        // 0x88A8(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_132;                        // 0x8968(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_24;                           // 0x8A28(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_92;                            // 0x8B80(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_91;                            // 0x8BA8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_90;                            // 0x8BD0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_89;                            // 0x8BF8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_23;                           // 0x8C20(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_88;                            // 0x8D78(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_133;                         // 0x8DA0(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_131;                        // 0x8E40(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_47;                 // 0x8F00(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_87;                            // 0x9090(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_86;                            // 0x90B8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_130;                        // 0x90E0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_85;                            // 0x91A0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_46;                 // 0x91C8(0x0190)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_12;                                     // 0x9358(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_129;                        // 0x93A0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_84;                            // 0x9460(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_22;                           // 0x9488(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_83;                            // 0x95E0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_132;                         // 0x9608(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_21;                           // 0x96A8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82;                            // 0x9800(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_81;                            // 0x9828(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_90;                          // 0x9850(0x00B0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_45;                 // 0x9900(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_80;                            // 0x9A90(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_131;                         // 0x9AB8(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_44;                 // 0x9B58(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_79;                            // 0x9CE8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_130;                         // 0x9D10(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_78;                            // 0x9DB0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_128;                        // 0x9DD8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_77;                            // 0x9E98(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_43;                 // 0x9EC0(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_76;                            // 0xA050(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_42;                 // 0xA078(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_41;                 // 0xA208(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_40;                 // 0xA398(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_75;                            // 0xA528(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_127;                        // 0xA550(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_74;                            // 0xA610(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_39;                 // 0xA638(0x0190)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5;                                // 0xA7C8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4;                                // 0xA8D0(0x0108)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_38;                 // 0xA9D8(0x0190)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_20;                           // 0xAB68(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_89;                          // 0xACC0(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_73;                            // 0xAD70(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_19;                           // 0xAD98(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_18;                           // 0xAEF0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_72;                            // 0xB048(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_71;                            // 0xB070(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_132;                        // 0xB098(0x00E8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_126;                        // 0xB180(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_125;                        // 0xB240(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_37;                 // 0xB300(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_70;                            // 0xB490(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_124;                        // 0xB4B8(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_36;                 // 0xB578(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_69;                            // 0xB708(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_131;                        // 0xB730(0x00E8)
	struct FAnimNode_PoseBlendNode                     AnimGraphNode_PoseBlendNode;                               // 0xB818(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_123;                        // 0xB8B8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_129;                         // 0xB978(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_68;                            // 0xBA18(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_67;                            // 0xBA40(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_35;                 // 0xBA68(0x0190)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_375;                          // 0xBBF8(0x0080)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_122;                        // 0xBC78(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_121;                        // 0xBD38(0x00C0)
	unsigned char                                      UnknownData_BR5Z[0x8];                                     // 0xBDF8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_DragonSpineSolver                 AnimGraphNode_DragonSpineSolver;                           // 0xBE00(0x0860)
	struct FAnimNode_DragonFeetSolver                  AnimGraphNode_DragonFeetSolver;                            // 0xC660(0x0710)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_66;                            // 0xCD70(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_65;                            // 0xCD98(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4;                     // 0xCDC0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4;                     // 0xCDE0(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_120;                        // 0xCE00(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_64;                            // 0xCEC0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_17;                           // 0xCEE8(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_128;                         // 0xD040(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_63;                            // 0xD0E0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_119;                        // 0xD108(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_34;                 // 0xD1C8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_62;                            // 0xD358(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_16;                           // 0xD380(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_33;                 // 0xD4D8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_61;                            // 0xD668(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_60;                            // 0xD690(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_118;                        // 0xD6B8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_59;                            // 0xD778(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_15;                           // 0xD7A0(0x0158)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_117;                        // 0xD8F8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_127;                         // 0xD9B8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_58;                            // 0xDA58(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_126;                         // 0xDA80(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_57;                            // 0xDB20(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_125;                         // 0xDB48(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_124;                         // 0xDBE8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_56;                            // 0xDC88(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_116;                        // 0xDCB0(0x00C0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_130;                        // 0xDD70(0x00E8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_32;                 // 0xDE58(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_55;                            // 0xDFE8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_31;                 // 0xE010(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_54;                            // 0xE1A0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_30;                 // 0xE1C8(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_29;                 // 0xE358(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_53;                            // 0xE4E8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_28;                 // 0xE510(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_27;                 // 0xE6A0(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_26;                 // 0xE830(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_52;                            // 0xE9C0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_51;                            // 0xE9E8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_14;                           // 0xEA10(0x0158)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_115;                        // 0xEB68(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_25;                 // 0xEC28(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_50;                            // 0xEDB8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_49;                            // 0xEDE0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_24;                 // 0xEE08(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_48;                            // 0xEF98(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_13;                           // 0xEFC0(0x0158)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3;                     // 0xF118(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_47;                            // 0xF138(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_114;                        // 0xF160(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_23;                 // 0xF220(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_46;                            // 0xF3B0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_12;                           // 0xF3D8(0x0158)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_113;                        // 0xF530(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_112;                        // 0xF5F0(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_11;                                     // 0xF6B0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_10;                                     // 0xF6F8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_45;                            // 0xF740(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_44;                            // 0xF768(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_22;                 // 0xF790(0x0190)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3;                                // 0xF920(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2;                                // 0xFA28(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_123;                         // 0xFB30(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_122;                         // 0xFBD0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_121;                         // 0xFC70(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_21;                 // 0xFD10(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_43;                            // 0xFEA0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_111;                        // 0xFEC8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_42;                            // 0xFF88(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_20;                 // 0xFFB0(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_19;                 // 0x10140(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_41;                            // 0x102D0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_40;                            // 0x102F8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_18;                 // 0x10320(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_110;                        // 0x104B0(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_17;                 // 0x10570(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_39;                            // 0x10700(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_120;                         // 0x10728(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_109;                        // 0x107C8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_38;                            // 0x10888(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_16;                 // 0x108B0(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_15;                 // 0x10A40(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_37;                            // 0x10BD0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_119;                         // 0x10BF8(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_11;                           // 0x10C98(0x0158)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_108;                        // 0x10DF0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_36;                            // 0x10EB0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_107;                        // 0x10ED8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_118;                         // 0x10F98(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_35;                            // 0x11038(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_117;                         // 0x11060(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_14;                 // 0x11100(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_34;                            // 0x11290(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_33;                            // 0x112B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_32;                            // 0x112E0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_13;                 // 0x11308(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_12;                 // 0x11498(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_11;                 // 0x11628(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_31;                            // 0x117B8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_30;                            // 0x117E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_266;                        // 0x11808(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_265;                        // 0x11830(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_264;                        // 0x11858(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_263;                        // 0x11880(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_262;                        // 0x118A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_261;                        // 0x118D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_260;                        // 0x118F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_259;                        // 0x11920(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_258;                        // 0x11948(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_257;                        // 0x11970(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_256;                        // 0x11998(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_255;                        // 0x119C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_254;                        // 0x119E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_253;                        // 0x11A10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_252;                        // 0x11A38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_251;                        // 0x11A60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_250;                        // 0x11A88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_249;                        // 0x11AB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_248;                        // 0x11AD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_247;                        // 0x11B00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_246;                        // 0x11B28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_245;                        // 0x11B50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_244;                        // 0x11B78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_243;                        // 0x11BA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_242;                        // 0x11BC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_241;                        // 0x11BF0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_374;                          // 0x11C18(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_145;                             // 0x11C98(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_373;                          // 0x11CC8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_144;                             // 0x11D48(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_372;                          // 0x11D78(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_143;                             // 0x11DF8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_371;                          // 0x11E28(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_142;                             // 0x11EA8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_370;                          // 0x11ED8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_141;                             // 0x11F58(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_369;                          // 0x11F88(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_140;                             // 0x12008(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_368;                          // 0x12038(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_139;                             // 0x120B8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_367;                          // 0x120E8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_138;                             // 0x12168(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_366;                          // 0x12198(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_137;                             // 0x12218(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_365;                          // 0x12248(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_136;                             // 0x122C8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_364;                          // 0x122F8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_135;                             // 0x12378(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_363;                          // 0x123A8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_134;                             // 0x12428(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_362;                          // 0x12458(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_133;                             // 0x124D8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_361;                          // 0x12508(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_132;                             // 0x12588(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_360;                          // 0x125B8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_131;                             // 0x12638(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_359;                          // 0x12668(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_130;                             // 0x126E8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_358;                          // 0x12718(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_129;                             // 0x12798(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_357;                          // 0x127C8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_128;                             // 0x12848(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_356;                          // 0x12878(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_127;                             // 0x128F8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_355;                          // 0x12928(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_126;                             // 0x129A8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_19;                             // 0x129D8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_10;                           // 0x12A88(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_116;                         // 0x12BE0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9;                            // 0x12C80(0x0158)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_240;                        // 0x12DD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_239;                        // 0x12E00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_238;                        // 0x12E28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_237;                        // 0x12E50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_236;                        // 0x12E78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_235;                        // 0x12EA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_234;                        // 0x12EC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_233;                        // 0x12EF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_232;                        // 0x12F18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_231;                        // 0x12F40(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_354;                          // 0x12F68(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_125;                             // 0x12FE8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_353;                          // 0x13018(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_124;                             // 0x13098(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_352;                          // 0x130C8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_123;                             // 0x13148(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_351;                          // 0x13178(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_122;                             // 0x131F8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_350;                          // 0x13228(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_121;                             // 0x132A8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_349;                          // 0x132D8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_120;                             // 0x13358(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_348;                          // 0x13388(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_119;                             // 0x13408(0x0030)
