#pragma once

// Name: Medieval Dynasty, Version: 0.6.0.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Girl_AnimBP.Girl_AnimBP_C
// 0x2620D (FullSize[0x264C5] - InheritedSize[0x02B8])
class UGirl_AnimBP_C : public UAnimInstance
{
public:
	unsigned char                                      UnknownData_UKY5[0x8];                                     // 0x02B8(0x0008) Fix Super Size
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x02C0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_94;                         // 0x02C8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_97;                            // 0x0388(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_96;                            // 0x03B0(0x0028)
	unsigned char                                      UnknownData_K8XX[0x8];                                     // 0x03D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_DragonSpineSolver                 AnimGraphNode_DragonSpineSolver;                           // 0x03E0(0x0860)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_95;                            // 0x0C40(0x0028)
	unsigned char                                      UnknownData_L4KO[0x8];                                     // 0x0C68(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_DragonFeetSolver                  AnimGraphNode_DragonFeetSolver;                            // 0x0C70(0x0710)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_26;                           // 0x1380(0x0158)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_93;                         // 0x14D8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_94;                            // 0x1598(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_93;                            // 0x15C0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_92;                            // 0x15E8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_92;                         // 0x1610(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_84;                          // 0x16D0(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3;                     // 0x1770(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_91;                            // 0x1790(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_25;                           // 0x17B8(0x0158)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3;                     // 0x1910(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_90;                            // 0x1930(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_83;                          // 0x1958(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_42;                 // 0x19F8(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_91;                         // 0x1B88(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_89;                            // 0x1C48(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_41;                 // 0x1C70(0x0190)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_82;                          // 0x1E00(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_88;                            // 0x1EA0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_40;                 // 0x1EC8(0x0190)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_24;                           // 0x2058(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_23;                           // 0x21B0(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_87;                            // 0x2308(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_90;                         // 0x2330(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_86;                            // 0x23F0(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_39;                 // 0x2418(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_85;                            // 0x25A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_248;                        // 0x25D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_247;                        // 0x25F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_246;                        // 0x2620(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_245;                        // 0x2648(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_244;                        // 0x2670(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_243;                        // 0x2698(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_242;                        // 0x26C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_241;                        // 0x26E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_240;                        // 0x2710(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_239;                        // 0x2738(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_238;                        // 0x2760(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_237;                        // 0x2788(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_236;                        // 0x27B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_235;                        // 0x27D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_234;                        // 0x2800(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_233;                        // 0x2828(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_232;                        // 0x2850(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_231;                        // 0x2878(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_230;                        // 0x28A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_229;                        // 0x28C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_228;                        // 0x28F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_227;                        // 0x2918(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_226;                        // 0x2940(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_225;                        // 0x2968(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_224;                        // 0x2990(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_223;                        // 0x29B8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_264;                          // 0x29E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_135;                             // 0x2A60(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_263;                          // 0x2A90(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_134;                             // 0x2B10(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_262;                          // 0x2B40(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_133;                             // 0x2BC0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_261;                          // 0x2BF0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_132;                             // 0x2C70(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_260;                          // 0x2CA0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_131;                             // 0x2D20(0x0030)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot_5;                              // 0x2D50(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_130;                             // 0x2DE0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_21;                             // 0x2E10(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_129;                             // 0x2EC0(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_222;                        // 0x2EF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_221;                        // 0x2F18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_220;                        // 0x2F40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_219;                        // 0x2F68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_218;                        // 0x2F90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_217;                        // 0x2FB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_216;                        // 0x2FE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_215;                        // 0x3008(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_259;                          // 0x3030(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_128;                             // 0x30B0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_258;                          // 0x30E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_127;                             // 0x3160(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_257;                          // 0x3190(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_126;                             // 0x3210(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_256;                          // 0x3240(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_125;                             // 0x32C0(0x0030)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot_4;                              // 0x32F0(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_124;                             // 0x3380(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_20;                             // 0x33B0(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_123;                             // 0x3460(0x0030)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_122;                             // 0x3490(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_214;                        // 0x34C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_213;                        // 0x34E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_212;                        // 0x3510(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_211;                        // 0x3538(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_210;                        // 0x3560(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_209;                        // 0x3588(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_208;                        // 0x35B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_207;                        // 0x35D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_206;                        // 0x3600(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_205;                        // 0x3628(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_204;                        // 0x3650(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_203;                        // 0x3678(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_202;                        // 0x36A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_201;                        // 0x36C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_200;                        // 0x36F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_199;                        // 0x3718(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_198;                        // 0x3740(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_197;                        // 0x3768(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_196;                        // 0x3790(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_195;                        // 0x37B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_194;                        // 0x37E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_193;                        // 0x3808(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_192;                        // 0x3830(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_191;                        // 0x3858(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_190;                        // 0x3880(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_189;                        // 0x38A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_188;                        // 0x38D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_187;                        // 0x38F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_186;                        // 0x3920(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_185;                        // 0x3948(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_184;                        // 0x3970(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_183;                        // 0x3998(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_182;                        // 0x39C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_181;                        // 0x39E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_180;                        // 0x3A10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_179;                        // 0x3A38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_178;                        // 0x3A60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_177;                        // 0x3A88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_176;                        // 0x3AB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_175;                        // 0x3AD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_174;                        // 0x3B00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_173;                        // 0x3B28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_172;                        // 0x3B50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_171;                        // 0x3B78(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_255;                          // 0x3BA0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_121;                             // 0x3C20(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_254;                          // 0x3C50(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_120;                             // 0x3CD0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_253;                          // 0x3D00(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_119;                             // 0x3D80(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_252;                          // 0x3DB0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_118;                             // 0x3E30(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_251;                          // 0x3E60(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_117;                             // 0x3EE0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_250;                          // 0x3F10(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_116;                             // 0x3F90(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_249;                          // 0x3FC0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_115;                             // 0x4040(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_248;                          // 0x4070(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_114;                             // 0x40F0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_247;                          // 0x4120(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_113;                             // 0x41A0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_246;                          // 0x41D0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_112;                             // 0x4250(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_245;                          // 0x4280(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_111;                             // 0x4300(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_244;                          // 0x4330(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_110;                             // 0x43B0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_243;                          // 0x43E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_109;                             // 0x4460(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_242;                          // 0x4490(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_108;                             // 0x4510(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_241;                          // 0x4540(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_107;                             // 0x45C0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_240;                          // 0x45F0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_106;                             // 0x4670(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_239;                          // 0x46A0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_105;                             // 0x4720(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_238;                          // 0x4750(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_104;                             // 0x47D0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_237;                          // 0x4800(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_103;                             // 0x4880(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_236;                          // 0x48B0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_102;                             // 0x4930(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_235;                          // 0x4960(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_101;                             // 0x49E0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_234;                          // 0x4A10(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_100;                             // 0x4A90(0x0030)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot_3;                              // 0x4AC0(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_99;                              // 0x4B50(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_19;                             // 0x4B80(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_98;                              // 0x4C30(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_170;                        // 0x4C60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_169;                        // 0x4C88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_168;                        // 0x4CB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_167;                        // 0x4CD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_166;                        // 0x4D00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_165;                        // 0x4D28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_164;                        // 0x4D50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_163;                        // 0x4D78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_162;                        // 0x4DA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_161;                        // 0x4DC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_160;                        // 0x4DF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_159;                        // 0x4E18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_158;                        // 0x4E40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_157;                        // 0x4E68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_156;                        // 0x4E90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_155;                        // 0x4EB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_154;                        // 0x4EE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_153;                        // 0x4F08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_152;                        // 0x4F30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_151;                        // 0x4F58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_150;                        // 0x4F80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_149;                        // 0x4FA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_148;                        // 0x4FD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_147;                        // 0x4FF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_146;                        // 0x5020(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_145;                        // 0x5048(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_144;                        // 0x5070(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_143;                        // 0x5098(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_142;                        // 0x50C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_141;                        // 0x50E8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_233;                          // 0x5110(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_97;                              // 0x5190(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_232;                          // 0x51C0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_96;                              // 0x5240(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_231;                          // 0x5270(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_95;                              // 0x52F0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_230;                          // 0x5320(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_94;                              // 0x53A0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_229;                          // 0x53D0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_93;                              // 0x5450(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_228;                          // 0x5480(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_92;                              // 0x5500(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_227;                          // 0x5530(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_91;                              // 0x55B0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_226;                          // 0x55E0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_90;                              // 0x5660(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_225;                          // 0x5690(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_89;                              // 0x5710(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_224;                          // 0x5740(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_88;                              // 0x57C0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_223;                          // 0x57F0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_87;                              // 0x5870(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_222;                          // 0x58A0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_86;                              // 0x5920(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_221;                          // 0x5950(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_85;                              // 0x59D0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_220;                          // 0x5A00(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_84;                              // 0x5A80(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_219;                          // 0x5AB0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_83;                              // 0x5B30(0x0030)
	struct FAnimNode_PoseSnapshot                      AnimGraphNode_PoseSnapshot_2;                              // 0x5B60(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_82;                              // 0x5BF0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_18;                             // 0x5C20(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_81;                              // 0x5CD0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_17;                             // 0x5D00(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_22;                           // 0x5DB0(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_38;                 // 0x5F08(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_89;                         // 0x6098(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_84;                            // 0x6158(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_81;                          // 0x6180(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_21;                           // 0x6220(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_83;                            // 0x6378(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_88;                         // 0x63A0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82;                            // 0x6460(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_20;                           // 0x6488(0x0158)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2;                     // 0x65E0(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_80;                          // 0x6600(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2;                     // 0x66A0(0x0020)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_58;                          // 0x66C0(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_81;                            // 0x6770(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_80;                            // 0x6798(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_19;                           // 0x67C0(0x0158)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_140;                        // 0x6918(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_139;                        // 0x6940(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_138;                        // 0x6968(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_137;                        // 0x6990(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_136;                        // 0x69B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_135;                        // 0x69E0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_218;                          // 0x6A08(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_80;                              // 0x6A88(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_217;                          // 0x6AB8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_79;                              // 0x6B38(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_216;                          // 0x6B68(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_78;                              // 0x6BE8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_215;                          // 0x6C18(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_77;                              // 0x6C98(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_214;                          // 0x6CC8(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_76;                              // 0x6D48(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_16;                             // 0x6D78(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_87;                         // 0x6E28(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_86;                         // 0x6EE8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_213;                          // 0x6FA8(0x0080)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_37;                 // 0x7028(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_36;                 // 0x71B8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_79;                            // 0x7348(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_78;                            // 0x7370(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_79;                          // 0x7398(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_85;                         // 0x7438(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_77;                            // 0x74F8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_76;                            // 0x7520(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_84;                         // 0x7548(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_78;                          // 0x7608(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_18;                           // 0x76A8(0x0158)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_134;                        // 0x7800(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_133;                        // 0x7828(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_132;                        // 0x7850(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_131;                        // 0x7878(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_130;                        // 0x78A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_129;                        // 0x78C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_128;                        // 0x78F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_127;                        // 0x7918(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_126;                        // 0x7940(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_125;                        // 0x7968(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_124;                        // 0x7990(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_123;                        // 0x79B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_122;                        // 0x79E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_121;                        // 0x7A08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_120;                        // 0x7A30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_119;                        // 0x7A58(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_212;                          // 0x7A80(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_75;                              // 0x7B00(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_211;                          // 0x7B30(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_74;                              // 0x7BB0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_210;                          // 0x7BE0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_73;                              // 0x7C60(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_209;                          // 0x7C90(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_72;                              // 0x7D10(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_208;                          // 0x7D40(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_71;                              // 0x7DC0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_207;                          // 0x7DF0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_70;                              // 0x7E70(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_206;                          // 0x7EA0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_69;                              // 0x7F20(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_205;                          // 0x7F50(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_68;                              // 0x7FD0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_204;                          // 0x8000(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_67;                              // 0x8080(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_203;                          // 0x80B0(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_66;                              // 0x8130(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_202;                          // 0x8160(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_65;                              // 0x81E0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_201;                          // 0x8210(0x0080)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_64;                              // 0x8290(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_15;                             // 0x82C0(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_83;                         // 0x8370(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_35;                 // 0x8430(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_34;                 // 0x85C0(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_75;                            // 0x8750(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_82;                         // 0x8778(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_33;                 // 0x8838(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_32;                 // 0x89C8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_74;                            // 0x8B58(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_81;                         // 0x8B80(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_31;                 // 0x8C40(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_73;                            // 0x8DD0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_72;                            // 0x8DF8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_71;                            // 0x8E20(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_70;                            // 0x8E48(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_69;                            // 0x8E70(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_30;                 // 0x8E98(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_80;                         // 0x9028(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_17;                           // 0x90E8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_68;                            // 0x9240(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_67;                            // 0x9268(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_66;                            // 0x9290(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_79;                         // 0x92B8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_77;                          // 0x9378(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_29;                 // 0x9418(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_65;                            // 0x95A8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_78;                         // 0x95D0(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_28;                 // 0x9690(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_64;                            // 0x9820(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_63;                            // 0x9848(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_16;                           // 0x9870(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_15;                           // 0x99C8(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_14;                           // 0x9B20(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_62;                            // 0x9C78(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_61;                            // 0x9CA0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_60;                            // 0x9CC8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_77;                         // 0x9CF0(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_76;                          // 0x9DB0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_59;                            // 0x9E50(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_58;                            // 0x9E78(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_76;                         // 0x9EA0(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_27;                 // 0x9F60(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_57;                            // 0xA0F0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_56;                            // 0xA118(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_13;                           // 0xA140(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_55;                            // 0xA298(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_26;                 // 0xA2C0(0x0190)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_75;                          // 0xA450(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_25;                 // 0xA4F0(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_54;                            // 0xA680(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_74;                          // 0xA6A8(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_24;                 // 0xA748(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_53;                            // 0xA8D8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_73;                          // 0xA900(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_23;                 // 0xA9A0(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_52;                            // 0xAB30(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_72;                          // 0xAB58(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_51;                            // 0xABF8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_50;                            // 0xAC20(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_75;                         // 0xAC48(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_49;                            // 0xAD08(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_48;                            // 0xAD30(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_22;                 // 0xAD58(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_74;                         // 0xAEE8(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_73;                         // 0xAFA8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_71;                          // 0xB068(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_12;                           // 0xB108(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_47;                            // 0xB260(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_72;                         // 0xB288(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_21;                 // 0xB348(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_46;                            // 0xB4D8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_45;                            // 0xB500(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_11;                           // 0xB528(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_20;                 // 0xB680(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_44;                            // 0xB810(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_70;                          // 0xB838(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_43;                            // 0xB8D8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_19;                 // 0xB900(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_71;                         // 0xBA90(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_69;                          // 0xBB50(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_42;                            // 0xBBF0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_70;                         // 0xBC18(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_18;                 // 0xBCD8(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_41;                            // 0xBE68(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_40;                            // 0xBE90(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_10;                           // 0xBEB8(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_17;                 // 0xC010(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_39;                            // 0xC1A0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_68;                          // 0xC1C8(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_16;                 // 0xC268(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_38;                            // 0xC3F8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_67;                          // 0xC420(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_15;                 // 0xC4C0(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_69;                         // 0xC650(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9;                            // 0xC710(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_37;                            // 0xC868(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_36;                            // 0xC890(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_35;                            // 0xC8B8(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_14;                 // 0xC8E0(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_68;                         // 0xCA70(0x00C0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_13;                 // 0xCB30(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_34;                            // 0xCCC0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8;                            // 0xCCE8(0x0158)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_33;                            // 0xCE40(0x0028)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_12;                 // 0xCE68(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_11;                 // 0xCFF8(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_10;                 // 0xD188(0x0190)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_9;                  // 0xD318(0x0190)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_67;                         // 0xD4A8(0x00C0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_66;                          // 0xD568(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_32;                            // 0xD608(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_31;                            // 0xD630(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7;                            // 0xD658(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_65;                          // 0xD7B0(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_8;                  // 0xD850(0x0190)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_30;                            // 0xD9E0(0x0028)
